benchmarks/results/auth-serialization/test-signup/optimization-01/wrk2-logs/run_1_1805_2029.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 660.501ms, rate sampling interval: 1358ms
  Thread calibration: mean lat.: 650.176ms, rate sampling interval: 1356ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   656.63ms   24.50ms 684.54ms   79.00%
    Req/Sec     1.75      0.43     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  663.55ms
 75.000%  675.33ms
 90.000%  679.93ms
 99.000%  684.54ms
 99.900%  685.05ms
 99.990%  685.05ms
 99.999%  685.05ms
100.000%  685.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     578.559     0.000000            1         1.00
     623.615     0.100000           11         1.11
     635.903     0.200000           20         1.25
     647.167     0.300000           30         1.43
     658.943     0.400000           40         1.67
     663.551     0.500000           50         2.00
     669.183     0.550000           55         2.22
     671.743     0.600000           60         2.50
     672.767     0.650000           67         2.86
     673.279     0.700000           70         3.33
     675.327     0.750000           76         4.00
     676.351     0.775000           79         4.44
     677.375     0.800000           82         5.00
     677.887     0.825000           84         5.71
     678.399     0.850000           87         6.67
     679.423     0.875000           89         8.00
     679.423     0.887500           89         8.89
     679.935     0.900000           92        10.00
     679.935     0.912500           92        11.43
     680.447     0.925000           93        13.33
     680.959     0.937500           95        16.00
     680.959     0.943750           95        17.78
     680.959     0.950000           95        20.00
     681.471     0.956250           96        22.86
     681.983     0.962500           97        26.67
     681.983     0.968750           97        32.00
     683.519     0.971875           98        35.56
     683.519     0.975000           98        40.00
     683.519     0.978125           98        45.71
     684.543     0.981250           99        53.33
     684.543     0.984375           99        64.00
     684.543     0.985938           99        71.11
     684.543     0.987500           99        80.00
     684.543     0.989062           99        91.43
     685.055     0.990625          100       106.67
     685.055     1.000000          100          inf
#[Mean    =      656.635, StdDeviation   =       24.504]
#[Max     =      684.544, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.02s, 60.23KB read
Requests/sec:      4.93
Transfer/sec:      2.01KB