benchmarks/results/auth-serialization/test-signup/optimization-01/wrk2-logs/run_2_1805_2030.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 657.877ms, rate sampling interval: 1361ms
  Thread calibration: mean lat.: 661.760ms, rate sampling interval: 1361ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   656.91ms   27.73ms 737.28ms   74.00%
    Req/Sec     1.75      0.43     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  665.09ms
 75.000%  675.84ms
 90.000%  679.93ms
 99.000%  734.72ms
 99.900%  737.79ms
 99.990%  737.79ms
 99.999%  737.79ms
100.000%  737.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     596.991     0.000000            1         1.00
     614.911     0.100000           10         1.11
     629.247     0.200000           22         1.25
     638.975     0.300000           30         1.43
     655.871     0.400000           40         1.67
     665.087     0.500000           50         2.00
     669.695     0.550000           56         2.22
     672.255     0.600000           60         2.50
     673.791     0.650000           66         2.86
     674.815     0.700000           70         3.33
     675.839     0.750000           75         4.00
     676.351     0.775000           80         4.44
     676.351     0.800000           80         5.00
     676.863     0.825000           83         5.71
     678.911     0.850000           85         6.67
     679.423     0.875000           88         8.00
     679.935     0.887500           91         8.89
     679.935     0.900000           91        10.00
     680.447     0.912500           92        11.43
     682.495     0.925000           93        13.33
     684.031     0.937500           95        16.00
     684.031     0.943750           95        17.78
     684.031     0.950000           95        20.00
     685.055     0.956250           96        22.86
     688.639     0.962500           97        26.67
     688.639     0.968750           97        32.00
     727.551     0.971875           98        35.56
     727.551     0.975000           98        40.00
     727.551     0.978125           98        45.71
     734.719     0.981250           99        53.33
     734.719     0.984375           99        64.00
     734.719     0.985938           99        71.11
     734.719     0.987500           99        80.00
     734.719     0.989062           99        91.43
     737.791     0.990625          100       106.67
     737.791     1.000000          100          inf
#[Mean    =      656.911, StdDeviation   =       27.729]
#[Max     =      737.280, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.01s, 60.01KB read
  Non-2xx or 3xx responses: 1
Requests/sec:      4.93
Transfer/sec:      2.00KB